app/controllers/deployments_controller.rb

  def show
    @deployment = @stage.deployments.find(params[:id])
---
SELECT * FROM `deployments` WHERE (`deployments`.`id` = 8 AND (`deployments`.stage_id = 1)) ORDER BY created_at DESC

  def new
    @deployment = @stage.deployments.new
    @deployment.task = params[:task]

    if params[:repeat]
      @original = @stage.deployments.find(params[:repeat])
---
SELECT * FROM `deployments` WHERE (`deployments`.`id` = 7)