app/controllers/recipes_controller.rb

SELECT * FROM `recipes` WHERE (`recipes`.`id` = 12)
---
  def find_recipe_with_version
    @recipe = Recipe.find(params[:id])