app/controllers/stages_controller.rb

  def show
    @stage = current_project.stages.find(params[:id])
---
SELECT * FROM `stages` WHERE (`stages`.`id` = 1 AND (`stages`.project_id = 1)) ORDER BY name ASC

  def edit
    @stage = current_project.stages.find(params[:id])
---
SELECT * FROM `stages` WHERE (`stages`.`id` = 1 AND (`stages`.project_id = 1)) ORDER BY name ASC

  def create
    @stage = current_project.stages.build(params[:stage])

    respond_to do |format|
      if @stage.save
---
INSERT INTO `stages` (`name`, `created_at`, `locked_by_deployment_id`, `project_id`, `updated_at`, `alert_emails`, `locked`) VALUES('Prod', '2010-09-14 19:57:02', NULL, 1, '2010-09-14 19:57:02', '', 0)

  def update
    @stage = current_project.stages.find(params[:id])

    respond_to do |format|
      if @stage.update_attributes(params[:stage])
---
SELECT * FROM `stages` WHERE (`stages`.`id` = 1 AND (`stages`.project_id = 1)) ORDER BY name ASC
UPDATE `stages` SET `updated_at` = '2010-09-14 03:31:07', `name` = 'Prod' WHERE `id` = 1

  def recipes
    @stage = current_project.stages.find(params[:id])
---
SELECT * FROM `stages` WHERE (`stages`.`id` = 1 AND (`stages`.project_id = 1)) ORDER BY name ASC